{"created":"2023-08-08 16:18:20","title":"Cumulative Reasoning with Large Language Models","abstract":"While language models are powerful and versatile, they often fail to address highly complex problems. This is because solving complex problems requires deliberate thinking, which has been only minimally guided during training. In this paper, we propose a new method called Cumulative Reasoning (CR), which employs language models in a cumulative and iterative manner to emulate human thought processes. By decomposing tasks into smaller components, CR streamlines the problem-solving process, rendering it both more manageable and effective. For logical inference tasks, CR consistently outperforms existing methods with an improvement up to 9.3%, and achieves the astonishing accuracy of 98.04% on the curated FOLIO wiki dataset. In the context of the Game of 24, CR achieves an accuracy of 94%, which signifies a substantial enhancement of 20% over the previous state-of-the-art method.","sentences":["While language models are powerful and versatile, they often fail to address highly complex problems.","This is because solving complex problems requires deliberate thinking, which has been only minimally guided during training.","In this paper, we propose a new method called Cumulative Reasoning (CR), which employs language models in a cumulative and iterative manner to emulate human thought processes.","By decomposing tasks into smaller components, CR streamlines the problem-solving process, rendering it both more manageable and effective.","For logical inference tasks, CR consistently outperforms existing methods with an improvement up to 9.3%, and achieves the astonishing accuracy of 98.04% on the curated FOLIO wiki dataset.","In the context of the Game of 24, CR achieves an accuracy of 94%, which signifies a substantial enhancement of 20% over the previous state-of-the-art method."],"url":"http://arxiv.org/abs/2308.04371v2"}
{"created":"2023-08-08 15:01:51","title":"Apple Vision Pro for Healthcare: \"The Ultimate Display\"? -- Entering the Wonderland of Precision","abstract":"At the Worldwide Developers Conference (WWDC) in June 2023, Apple introduced the Vision Pro. The Vision Pro is a Mixed Reality (MR) headset, more specifically it is a Virtual Reality (VR) device with an additional Video See-Through (VST) capability. The VST capability turns the Vision Pro also into an Augmented Reality (AR) device. The AR feature is enabled by streaming the real world via cameras to the (VR) screens in front of the user's eyes. This is of course not unique and similar to other devices, like the Varjo XR-3. Nevertheless, the Vision Pro has some interesting features, like an inside-out screen that can show the headset wearers' eyes to \"outsiders\" or a button on the top, called \"Digital Crown\", that allows you to seamlessly blend digital content with your physical space by turning it. In addition, it is untethered, except for the cable to the battery, which makes the headset more agile, compared to the Varjo XR-3. This could actually come closer to the \"Ultimate Display\", which Ivan Sutherland had already sketched in 1965. Not available to the public yet, like the Ultimate Display, we want to take a look into the crystal ball in this perspective to see if it can overcome some clinical challenges that - especially - AR still faces in the medical domain, but also go beyond and discuss if the Vision Pro could support clinicians in essential tasks to spend more time with their patients.","sentences":["At the Worldwide Developers Conference (WWDC) in June 2023, Apple introduced the Vision Pro.","The Vision Pro is a Mixed Reality (MR) headset, more specifically it is a Virtual Reality (VR) device with an additional Video See-Through (VST) capability.","The VST capability turns the Vision Pro also into an Augmented Reality (AR) device.","The AR feature is enabled by streaming the real world via cameras to the (VR) screens in front of the user's eyes.","This is of course not unique and similar to other devices, like the Varjo XR-3.","Nevertheless, the Vision Pro has some interesting features, like an inside-out screen that can show the headset wearers' eyes to \"outsiders\" or a button on the top, called \"Digital Crown\", that allows you to seamlessly blend digital content with your physical space by turning it.","In addition, it is untethered, except for the cable to the battery, which makes the headset more agile, compared to the Varjo XR-3.","This could actually come closer to the \"Ultimate Display\", which Ivan Sutherland had already sketched in 1965.","Not available to the public yet, like the Ultimate Display, we want to take a look into the crystal ball in this perspective to see if it can overcome some clinical challenges that - especially - AR still faces in the medical domain, but also go beyond and discuss if the Vision Pro could support clinicians in essential tasks to spend more time with their patients."],"url":"http://arxiv.org/abs/2308.04313v2"}
