{"created":"2024-08-27 15:03:20","title":"Machine Learning for Methane Detection and Quantification from Space - A survey","abstract":"Methane ($CH_4$) is a potent anthropogenic greenhouse gas, contributing 86 times more to global warming than Carbon Dioxide ($CO_2$) over 20 years, and it also acts as an air pollutant. Given its high radiative forcing potential and relatively short atmospheric lifetime (9$\\pm$1 years), methane has important implications for climate change, therefore, cutting methane emissions is crucial for effective climate change mitigation. This work expands existing information on operational methane point source detection sensors in the Short-Wave Infrared (SWIR) bands. It reviews the state-of-the-art for traditional as well as Machine Learning (ML) approaches. The architecture and data used in such ML models will be discussed separately for methane plume segmentation and emission rate estimation. Traditionally, experts rely on labor-intensive manually adjusted methods for methane detection. However, ML approaches offer greater scalability. Our analysis reveals that ML models outperform traditional methods, particularly those based on convolutional neural networks (CNN), which are based on the U-net and transformer architectures. These ML models extract valuable information from methane-sensitive spectral data, enabling a more accurate detection. Challenges arise when comparing these methods due to variations in data, sensor specifications, and evaluation metrics. To address this, we discuss existing datasets and metrics, providing an overview of available resources and identifying open research problems. Finally, we explore potential future advances in ML, emphasizing approaches for model comparability, large dataset creation, and the European Union's forthcoming methane strategy.","sentences":["Methane ($CH_4$) is a potent anthropogenic greenhouse gas, contributing 86 times more to global warming than Carbon Dioxide ($CO_2$) over 20 years, and it also acts as an air pollutant.","Given its high radiative forcing potential and relatively short atmospheric lifetime (9$\\pm$1 years), methane has important implications for climate change, therefore, cutting methane emissions is crucial for effective climate change mitigation.","This work expands existing information on operational methane point source detection sensors in the Short-Wave Infrared (SWIR) bands.","It reviews the state-of-the-art for traditional as well as Machine Learning (ML) approaches.","The architecture and data used in such ML models will be discussed separately for methane plume segmentation and emission rate estimation.","Traditionally, experts rely on labor-intensive manually adjusted methods for methane detection.","However, ML approaches offer greater scalability.","Our analysis reveals that ML models outperform traditional methods, particularly those based on convolutional neural networks (CNN), which are based on the U-net and transformer architectures.","These ML models extract valuable information from methane-sensitive spectral data, enabling a more accurate detection.","Challenges arise when comparing these methods due to variations in data, sensor specifications, and evaluation metrics.","To address this, we discuss existing datasets and metrics, providing an overview of available resources and identifying open research problems.","Finally, we explore potential future advances in ML, emphasizing approaches for model comparability, large dataset creation, and the European Union's forthcoming methane strategy."],"url":"http://arxiv.org/abs/2408.15122v1"}
